apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpuart.h
/********************************************************************************************
 * arch/arm/src/s32k1xx/hardware/imxrt_lpuart.h
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *   Author:  Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_LPUART_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_LPUART_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>
#include "hardware/s32k1xx_memorymap.h"

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* Register offsets *************************************************************************/

#define S32K1XX_LPUART_VERID_OFFSET      0x0000  /* Version ID Register */
#define S32K1XX_LPUART_PARAM_OFFSET      0x0004  /* Parameter Register */
#define S32K1XX_LPUART_GLOBAL_OFFSET     0x0008  /* LPUART Global Register */
#define S32K1XX_LPUART_PINCFG_OFFSET     0x000c  /* LPUART Pin Configuration Register */
#define S32K1XX_LPUART_BAUD_OFFSET       0x0010  /* LPUART Baud Rate Register */
#define S32K1XX_LPUART_STAT_OFFSET       0x0014  /* LPUART Status Register */
#define S32K1XX_LPUART_CTRL_OFFSET       0x0018  /* LPUART Control Register */
#define S32K1XX_LPUART_DATA_OFFSET       0x001c  /* LPUART Data Register */
#define S32K1XX_LPUART_MATCH_OFFSET      0x0020  /* LPUART Match Address Register */
#define S32K1XX_LPUART_MODIR_OFFSET      0x0024  /* LPUART Modem IrDA Register */
#define S32K1XX_LPUART_FIFO_OFFSET       0x0028  /* LPUART FIFO Register */
#define S32K1XX_LPUART_WATER_OFFSET      0x002c  /* LPUART Watermark Register */

/* Register addresses ***********************************************************************/

#define S32K1XX_LPUART0_VERID            (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_VERID_OFFSET)
#define S32K1XX_LPUART0_PARAM            (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_PARAM_OFFSET)
#define S32K1XX_LPUART0_GLOBAL           (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_GLOBAL_OFFSET)
#define S32K1XX_LPUART0_PINCFG           (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_PINCFG_OFFSET)
#define S32K1XX_LPUART0_BAUD             (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_BAUD_OFFSET)
#define S32K1XX_LPUART0_STAT             (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_STAT_OFFSET)
#define S32K1XX_LPUART0_CTRL             (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_CTRL_OFFSET)
#define S32K1XX_LPUART0_DATA             (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_DATA_OFFSET)
#define S32K1XX_LPUART0_MATCH            (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_MATCH_OFFSET)
#define S32K1XX_LPUART0_MODIR            (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_MODIR_OFFSET)
#define S32K1XX_LPUART0_FIFO             (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_FIFO_OFFSET)
#define S32K1XX_LPUART0_WATER            (S32K1XX_LPUART0_BASE + S32K1XX_LPUART_WATER_OFFSET)

#define S32K1XX_LPUART1_VERID            (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_VERID_OFFSET)
#define S32K1XX_LPUART1_PARAM            (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_PARAM_OFFSET)
#define S32K1XX_LPUART1_GLOBAL           (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_GLOBAL_OFFSET)
#define S32K1XX_LPUART1_PINCFG           (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_PINCFG_OFFSET)
#define S32K1XX_LPUART1_BAUD             (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_BAUD_OFFSET)
#define S32K1XX_LPUART1_STAT             (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_STAT_OFFSET)
#define S32K1XX_LPUART1_CTRL             (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_CTRL_OFFSET)
#define S32K1XX_LPUART1_DATA             (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_DATA_OFFSET)
#define S32K1XX_LPUART1_MATCH            (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_MATCH_OFFSET)
#define S32K1XX_LPUART1_MODIR            (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_MODIR_OFFSET)
#define S32K1XX_LPUART1_FIFO             (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_FIFO_OFFSET)
#define S32K1XX_LPUART1_WATER            (S32K1XX_LPUART1_BASE + S32K1XX_LPUART_WATER_OFFSET)

#define S32K1XX_LPUART2_VERID            (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_VERID_OFFSET)
#define S32K1XX_LPUART2_PARAM            (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_PARAM_OFFSET)
#define S32K1XX_LPUART2_GLOBAL           (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_GLOBAL_OFFSET)
#define S32K1XX_LPUART2_PINCFG           (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_PINCFG_OFFSET)
#define S32K1XX_LPUART2_BAUD             (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_BAUD_OFFSET)
#define S32K1XX_LPUART2_STAT             (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_STAT_OFFSET)
#define S32K1XX_LPUART2_CTRL             (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_CTRL_OFFSET)
#define S32K1XX_LPUART2_DATA             (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_DATA_OFFSET)
#define S32K1XX_LPUART2_MATCH            (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_MATCH_OFFSET)
#define S32K1XX_LPUART2_MODIR            (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_MODIR_OFFSET)
#define S32K1XX_LPUART2_FIFO             (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_FIFO_OFFSET)
#define S32K1XX_LPUART2_WATER            (S32K1XX_LPUART2_BASE + S32K1XX_LPUART_WATER_OFFSET)

